app/views/users/index.html.erb

        <td><%= link_to user.username, user %></td>
        <td><%= user.beers.size %></td>
        <td><%= user.ratings.size %></td>
---
SELECT COUNT(*) FROM "beers" INNER JOIN "ratings" ON "beers"."id" = "ratings"."beer_id" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" IN (1, 2, 3, 4, 5)
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]