app/controllers/beers_controller.rb

  def index
    @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" IN (1, 2, 3, 6)
SELECT "styles".* FROM "styles" WHERE "styles"."id" IN (1, 2, 3, 4)

  def create
    expire_fragment('beerlist')
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 6], ["created_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00], ["name", "Sierra Nevada Pale Ale"], ["style_id", 2], ["updated_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00]]

  def update
    expire_fragment('beerlist')
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "name" = ?, "updated_at" = ? WHERE "beers"."id" = 6  [["name", "Hefeweizen"], ["updated_at", Thu, 30 Jan 2014 18:16:45 UTC +00:00]]

  def destroy
    expire_fragment('beerlist')
    @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 11]]