app/controllers/breweries_controller.rb

  def toggle_activity
  	brewery = Brewery.find(params[:id])
  	brewery.update_attribute :active, (not brewery.active)
---
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "breweries" SET "active" = ?, "updated_at" = ? WHERE "breweries"."id" = 2  [["active", false], ["updated_at", Fri, 21 Feb 2014 23:13:48 UTC +00:00]]