app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", Thu, 16 Jan 2014 14:46:13 UTC +00:00], ["score", 20], ["updated_at", Thu, 16 Jan 2014 14:46:13 UTC +00:00]]
SELECT "beers".* FROM "beers"
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if @rating.save
      current_user.ratings << @rating
      redirect_to user_path current_user
    else
      @beers = Beer.all